Revit 2017 API
View.ConvertToIndependent Method
 Convert the dependent view to independent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public void ConvertToIndependent()
Visual Basic
Public Sub ConvertToIndependent
Visual C++
public:
void ConvertToIndependent()
Remarks
 This method can be only applied to a dependent view. A dependent view can be created from another view using method View.Duplicate(ViewDuplicateOption.AsDependent). Dependent views have a valid primary view element ID that can be obtained via method View.GetPrimaryViewId(); Independent views have InvalidElementId as their primary view ID.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This view is not dependent.
See Also
View Class
Autodesk.Revit.DB Namespace